[
    {
        "id": 1,
        "nombre": "PHP",
        "descripcion": "¡Bienvenido al curso de PHP de ByteQuest!\n\nPHP es uno de los lenguajes de programación más utilizados en el desarrollo web. Gracias a su facilidad de uso y gran compatibilidad con bases de datos, PHP impulsa millones de sitios y plataformas dinámicas alrededor del mundo.\n\nEn este curso aprenderás desde lo más básico: entenderás la sintaxis, variables, operadores, estructuras de control, funciones y cómo PHP se integra con HTML para crear páginas dinámicas. También verás cómo trabajar con formularios, sesiones y bases de datos MySQL para construir aplicaciones web completas.",
        "created_at": "2025-07-09T03:05:32.000000Z",
        "updated_at": "2025-07-09T03:05:32.000000Z"
    },
    {
        "id": 2,
        "nombre": "JavaScript",
        "descripcion": "Bienvenido al curso de JavaScript de ByteQuest!\n\nJavaScript es el lenguaje clave para darle interactividad y dinamismo a cualquier sitio web. Es uno de los lenguajes más demandados en el mundo del desarrollo frontend y backend gracias a su versatilidad y potencia.\n\nEn este curso descubrirás desde lo esencial: variables, tipos de datos, operadores, funciones, estructuras de control y manipulación del DOM para interactuar directamente con el contenido de una página. También tendrás una introducción a temas como eventos, asincronía y buenas prácticas modernas.",
        "created_at": "2025-07-09T03:05:32.000000Z",
        "updated_at": "2025-07-09T03:05:32.000000Z"
    },
    {
        "id": 3,
        "nombre": "Python",
        "descripcion": "¡Bienvenido al curso de Python de ByteQuest!\n\nEn este recorrido aprenderás uno de los lenguajes de programación más populares y versátiles del mundo. Python es conocido por su sintaxis clara, simple y amigable para quienes se inician en el mundo del código.\n\nDurante este curso explorarás desde los conceptos más básicos —como variables, tipos de datos, operadores y estructuras de control— hasta temas más avanzados como funciones, manejo de archivos y programación orientada a objetos.",
        "created_at": "2025-07-09T03:05:32.000000Z",
        "updated_at": "2025-07-09T03:05:32.000000Z"
    }
]